RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN236/MCXN236/drivers/fsl_pwm.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_pwm.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.pwm"
#endif

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/*!
 * @brief Get the instance from the base address
 *
 * @param base PWM peripheral base address
 *
 * @return The PWM module instance
 */
static uint32_t PWM_GetInstance(PWM_Type *base);

#if defined(PWM_RSTS)
#define PWM_RESETS_ARRAY PWM_RSTS
#elif defined(FLEXPWM_RSTS)
#define PWM_RESETS_ARRAY FLEXPWM_RSTS
#elif defined(FLEXPWM_RSTS_N)
#define PWM_RESETS_ARRAY FLEXPWM_RSTS_N
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Pointers to PWM bases for each instance. */
static PWM_Type *const s_pwmBases[] = PWM_BASE_PTRS;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief Pointers to PWM clocks for each PWM submodule. */
static const clock_ip_name_t s_pwmClocks[][FSL_FEATURE_PWM_SUBMODULE_COUNT] = PWM_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(PWM_RESETS_ARRAY)
/* Reset array */
static const reset_ip_name_t s_pwmResets[] = PWM_RESETS_ARRAY;
#endif

/*! @brief Temporary PWM duty cycle. */
static uint8_t s_pwmGetPwmDutyCycle[FSL_FEATURE_PWM_SUBMODULE_COUNT][PWM_SUBMODULE_CHANNEL] = {{0}};

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * brief Complement the variable of type uint16_t as needed
 *
 * This function can complement the variable of type uint16_t as needed.For example,
 * need to ask for the opposite of a positive integer.
 *
 * param value    Parameters of type uint16_t
 */
static inline uint16_t PWM_GetComplementU16(uint16_t value)
{
    return (~value + 1U);
}

static inline uint16_t dutyCycleToReloadValue(uint8_t dutyCyclePercent)
{
    /* Rounding calculations to improve the accuracy of reloadValue */
    return ((65535U * dutyCyclePercent) + 50U) / 100U;
}

static uint32_t PWM_GetInstance(PWM_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < ARRAY_SIZE(s_pwmBases); instance++)
    {
        if (s_pwmBases[instance] == base)
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_pwmBases));

    return instance;
}

/*!
 * brief Set register about period on one PWM submodule.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param mode        PWM operation mode, options available in enumeration ::pwm_mode_t
 * param pulseCnt    PWM period, value should be between 0 to 65535
 */
static void PWM_SetPeriodRegister(PWM_Type *base, pwm_submodule_t subModule, pwm_mode_t mode, uint16_t pulseCnt)
{
    uint16_t modulo = 0;

    switch (mode)
    {
        case kPWM_SignedCenterAligned:
            /* Setup the PWM period for a signed center aligned signal */
            modulo = (pulseCnt >> 1U);
            /* Indicates the start of the PWM period */
            base->SM[subModule].INIT = PWM_GetComplementU16(modulo);
            /* Indicates the center value */
            base->SM[subModule].VAL0 = 0;
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            base->SM[subModule].VAL1 = modulo - 1U;
            break;
        case kPWM_CenterAligned:
            /* Setup the PWM period for an unsigned center aligned signal */
            /* Indicates the start of the PWM period */
            base->SM[subModule].INIT = 0;
            /* Indicates the center value */
            base->SM[subModule].VAL0 = (pulseCnt / 2U);
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            base->SM[subModule].VAL1 = pulseCnt - 1U;
            break;
        case kPWM_SignedEdgeAligned:
            /* Setup the PWM period for a signed edge aligned signal */
            modulo = (pulseCnt >> 1U);
            /* Indicates the start of the PWM period */
            base->SM[subModule].INIT = PWM_GetComplementU16(modulo);
            /* Indicates the center value */
            base->SM[subModule].VAL0 = 0;
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            base->SM[subModule].VAL1 = modulo - 1U;
            break;
        case kPWM_EdgeAligned:
            /* Setup the PWM period for a unsigned edge aligned signal */
            /* Indicates the start of the PWM period */
            base->SM[subModule].INIT = 0;
            /* Indicates the center value */
            base->SM[subModule].VAL0 = (pulseCnt / 2U);
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            base->SM[subModule].VAL1 = pulseCnt - 1U;
            break;
        default:
            assert(false);
            break;
    }
}

/*!
 * brief Set register about dutycycle on one PWM submodule.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param pwmSignal   Signal (PWM A or PWM B) to update
 * param mode        PWM operation mode, options available in enumeration ::pwm_mode_t
 * param pulseCnt    PWM period, value should be between 0 to 65535
 * param dutyCycle         New PWM pulse width, value should be between 0 to 65535
 */
static void PWM_SetDutycycleRegister(PWM_Type *base,
                                     pwm_submodule_t subModule,
                                     pwm_channels_t pwmSignal,
                                     pwm_mode_t mode,
                                     uint16_t pulseCnt,
                                     uint16_t pwmHighPulse)
{
    uint16_t modulo = 0;

    switch (mode)
    {
        case kPWM_SignedCenterAligned:
            /* Setup the PWM dutycycle for a signed center aligned signal */
            if (pwmSignal == kPWM_PwmA)
            {
                base->SM[subModule].VAL2 = PWM_GetComplementU16(pwmHighPulse / 2U);
                base->SM[subModule].VAL3 = (pwmHighPulse / 2U);
            }
            else if (pwmSignal == kPWM_PwmB)
            {
                base->SM[subModule].VAL4 = PWM_GetComplementU16(pwmHighPulse / 2U);
                base->SM[subModule].VAL5 = (pwmHighPulse / 2U);
            }
            else
            {
                ; /* Intentional empty */
            }
            break;
        case kPWM_CenterAligned:
            /* Setup the PWM dutycycle for an unsigned center aligned signal */
            if (pwmSignal == kPWM_PwmA)
            {
                base->SM[subModule].VAL2 = ((pulseCnt - pwmHighPulse) / 2U);
                base->SM[subModule].VAL3 = ((pulseCnt + pwmHighPulse) / 2U);
            }
            else if (pwmSignal == kPWM_PwmB)
            {
                base->SM[subModule].VAL4 = ((pulseCnt - pwmHighPulse) / 2U);
                base->SM[subModule].VAL5 = ((pulseCnt + pwmHighPulse) / 2U);
            }
            else
            {
                ; /* Intentional empty */
            }
            break;
        case kPWM_SignedEdgeAligned:
            modulo = (pulseCnt >> 1U);

            /* Setup the PWM dutycycle for a signed edge aligned signal */
            if (pwmSignal == kPWM_PwmA)
            {
                base->SM[subModule].VAL2 = PWM_GetComplementU16(modulo);
                base->SM[subModule].VAL3 = PWM_GetComplementU16(modulo) + pwmHighPulse;
            }
            else if (pwmSignal == kPWM_PwmB)
            {
                base->SM[subModule].VAL4 = PWM_GetComplementU16(modulo);
                base->SM[subModule].VAL5 = PWM_GetComplementU16(modulo) + pwmHighPulse;
            }
            else
            {
                ; /* Intentional empty */
            }
            break;
        case kPWM_EdgeAligned:
            /* Setup the PWM dutycycle for a unsigned edge aligned signal */
            if (pwmSignal == kPWM_PwmA)
            {
                base->SM[subModule].VAL2 = 0;
                base->SM[subModule].VAL3 = pwmHighPulse;
            }
            else if (pwmSignal == kPWM_PwmB)
            {
                base->SM[subModule].VAL4 = 0;
                base->SM[subModule].VAL5 = pwmHighPulse;
            }
            else
            {
                ; /* Intentional empty */
            }
            break;
        default:
            assert(false);
            break;
    }
}

/*!
 * brief Ungates the PWM submodule clock and configures the peripheral for basic operation.
 *
 * note This API should be called at the beginning of the application using the PWM driver.
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 * param config    Pointer to user's PWM config structure.
 *
 * return kStatus_Success means success; else failed.
 */
status_t PWM_Init(PWM_Type *base, pwm_submodule_t subModule, const pwm_config_t *config)
{
    assert(config);

    uint16_t reg;

    /* Source clock for submodule 0 cannot be itself */
    if ((config->clockSource == kPWM_Submodule0Clock) && (subModule == kPWM_Module_0))
    {
        return kStatus_Fail;
    }

    /* Reload source select clock for submodule 0 cannot be master reload */
    if ((config->reloadSelect == kPWM_MasterReload) && (subModule == kPWM_Module_0))
    {
        return kStatus_Fail;
    }

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Ungate the PWM submodule clock*/
    CLOCK_EnableClock(s_pwmClocks[PWM_GetInstance(base)][subModule]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(PWM_RESETS_ARRAY)
    RESET_ReleasePeripheralReset(s_pwmResets[PWM_GetInstance(base)]);
#endif

    /* Clear the fault status flags */
    base->FSTS |= PWM_FSTS_FFLAG_MASK;

    reg = base->SM[subModule].CTRL2;

