RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN236/MCXN236/drivers/fsl_pwm.c
        /* Setup register shift values based on the channel being configured.
         * Also setup the deadtime value
         */
        if (chnlParams->pwmChannel == kPWM_PwmA)
        {
            polarityShift              = PWM_OCTRL_POLA_SHIFT;
            outputEnableShift          = PWM_OUTEN_PWMA_EN_SHIFT;
            base->SM[subModule].DTCNT0 = PWM_DTCNT0_DTCNT0(chnlParams->deadtimeValue);
        }
        else
        {
            polarityShift              = PWM_OCTRL_POLB_SHIFT;
            outputEnableShift          = PWM_OUTEN_PWMB_EN_SHIFT;
            base->SM[subModule].DTCNT1 = PWM_DTCNT1_DTCNT1(chnlParams->deadtimeValue);
        }

        /* Set PWM output fault status */
        switch (chnlParams->pwmChannel)
        {
            case kPWM_PwmA:
                base->SM[subModule].OCTRL &= ~((uint16_t)PWM_OCTRL_PWMAFS_MASK);
                base->SM[subModule].OCTRL |= (((uint16_t)(chnlParams->faultState) << (uint16_t)PWM_OCTRL_PWMAFS_SHIFT) &
                                              (uint16_t)PWM_OCTRL_PWMAFS_MASK);
                break;
            case kPWM_PwmB:
                base->SM[subModule].OCTRL &= ~((uint16_t)PWM_OCTRL_PWMBFS_MASK);
                base->SM[subModule].OCTRL |= (((uint16_t)(chnlParams->faultState) << (uint16_t)PWM_OCTRL_PWMBFS_SHIFT) &
                                              (uint16_t)PWM_OCTRL_PWMBFS_MASK);
                break;
            default:
                assert(false);
                break;
        }

        /* Setup signal active level */
        if ((bool)chnlParams->level == kPWM_HighTrue)
        {
            base->SM[subModule].OCTRL &= ~((uint16_t)1U << (uint16_t)polarityShift);
        }
        else
        {
            base->SM[subModule].OCTRL |= ((uint16_t)1U << (uint16_t)polarityShift);
        }
        if (chnlParams->pwmchannelenable)
        {
            /* Enable PWM output */
            base->OUTEN |= ((uint16_t)1U << ((uint16_t)outputEnableShift + (uint16_t)subModule));
        }

        /* Get the pwm duty cycle */
        s_pwmGetPwmDutyCycle[subModule][chnlParams->pwmChannel] = chnlParams->dutyCyclePercent;

        /* Get the next channel parameters */
        chnlParams++;
    }

    return kStatus_Success;
}

/*!
 * brief Set PWM phase shift for PWM channel running on channel PWM_A, PWM_B which with 50% duty cycle.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param pwmChannel  PWM channel to configure
 * param pwmFreq_Hz  PWM signal frequency in Hz
 * param srcClock_Hz PWM main counter clock in Hz.
 * param shiftvalue  Phase shift value, range in 0 ~ 50
 * param doSync      true: Set LDOK bit for the submodule list;
 *                   false: LDOK bit don't set, need to call PWM_SetPwmLdok to sync update.
 *
 * return Returns kStatus_Fail if there was error setting up the signal; kStatus_Success otherwise
 */
status_t PWM_SetupPwmPhaseShift(PWM_Type *base,
                                pwm_submodule_t subModule,
                                pwm_channels_t pwmChannel,
                                uint32_t pwmFreq_Hz,
                                uint32_t srcClock_Hz,
                                uint8_t shiftvalue,
                                bool doSync)
{
    assert(pwmFreq_Hz != 0U);
    assert(srcClock_Hz != 0U);
    assert(shiftvalue <= 50U);

    uint32_t pwmClock;
    uint16_t pulseCnt = 0, pwmHighPulse = 0;
    uint16_t modulo = 0;
    uint16_t shift  = 0;

    if (pwmChannel != kPWM_PwmX)
    {
        /* Divide the clock by the prescale value */
        pwmClock = (srcClock_Hz / (1UL << ((base->SM[subModule].CTRL & PWM_CTRL_PRSC_MASK) >> PWM_CTRL_PRSC_SHIFT)));
        pulseCnt = (uint16_t)(pwmClock / pwmFreq_Hz);

        /* Clear LDOK bit if it is set */
        if (0U != (base->MCTRL & PWM_MCTRL_LDOK(1UL << (uint8_t)subModule)))
        {
            base->MCTRL |= PWM_MCTRL_CLDOK(1UL << (uint8_t)subModule);
        }

        modulo = (pulseCnt >> 1U);
        /* Indicates the start of the PWM period */
        base->SM[subModule].INIT = PWM_GetComplementU16(modulo);
        /* Indicates the center value */
        base->SM[subModule].VAL0 = 0;
        /* Indicates the end of the PWM period */
        /* The change during the end to start of the PWM period requires a count time */
        base->SM[subModule].VAL1 = modulo - 1U;

        /* Immediately upon when MCTRL[LDOK] being set */
        base->SM[subModule].CTRL |= PWM_CTRL_LDMOD_MASK;

        /* phase shift value */
        shift = (pulseCnt * shiftvalue) / 100U;

        /* duty cycle 50% */
        pwmHighPulse = pulseCnt / 2U;

        if (pwmChannel == kPWM_PwmA)
        {
            base->SM[subModule].VAL2 = PWM_GetComplementU16(modulo) + shift;
            base->SM[subModule].VAL3 = PWM_GetComplementU16(modulo) + pwmHighPulse + shift - 1U;
        }
        else if (pwmChannel == kPWM_PwmB)
        {
            base->SM[subModule].VAL4 = PWM_GetComplementU16(modulo) + shift;
            base->SM[subModule].VAL5 = PWM_GetComplementU16(modulo) + pwmHighPulse + shift - 1U;
        }
        else
        {
            return kStatus_Fail;
        }

        if (doSync)
        {
            /* Set LDOK bit to load VALx bit */
            base->MCTRL |= PWM_MCTRL_LDOK(1UL << (uint8_t)subModule);
        }
    }
    else
    {
        return kStatus_Fail;
    }

    return kStatus_Success;
}

/*!
 * brief Updates the PWM signal's dutycycle.
 *
 * The function updates the PWM dutycyle to the new value that is passed in.
 * If the dead time insertion logic is enabled then the pulse period is reduced by the
 * dead time period specified by the user.
 *
 * param base              PWM peripheral base address
 * param subModule         PWM submodule to configure
 * param pwmSignal         Signal (PWM A or PWM B) to update
 * param currPwmMode       The current PWM mode set during PWM setup
 * param dutyCyclePercent  New PWM pulse width, value should be between 0 to 100
 *                          0=inactive signal(0% duty cycle)...
 *                          100=active signal (100% duty cycle)
 */
void PWM_UpdatePwmDutycycle(PWM_Type *base,
                            pwm_submodule_t subModule,
                            pwm_channels_t pwmSignal,
                            pwm_mode_t currPwmMode,
                            uint8_t dutyCyclePercent)
{
    assert(dutyCyclePercent <= 100U);
    assert(pwmSignal != kPWM_PwmX);
    uint16_t reloadValue = dutyCycleToReloadValue(dutyCyclePercent);

    PWM_UpdatePwmDutycycleHighAccuracy(base, subModule, pwmSignal, currPwmMode, reloadValue);
}

/*!
 * brief Updates the PWM signal's dutycycle with 16-bit accuracy.
 *
 * The function updates the PWM dutycyle to the new value that is passed in.
 * If the dead time insertion logic is enabled then the pulse period is reduced by the
 * dead time period specified by the user.
 *
 * param base              PWM peripheral base address
 * param subModule         PWM submodule to configure
 * param pwmSignal         Signal (PWM A or PWM B) to update
 * param currPwmMode       The current PWM mode set during PWM setup
 * param dutyCycle         New PWM pulse width, value should be between 0 to 65535
 *                          0=inactive signal(0% duty cycle)...
 *                          65535=active signal (100% duty cycle)
 */
void PWM_UpdatePwmDutycycleHighAccuracy(
    PWM_Type *base, pwm_submodule_t subModule, pwm_channels_t pwmSignal, pwm_mode_t currPwmMode, uint16_t dutyCycle)
{
    assert(pwmSignal != kPWM_PwmX);
    uint16_t pulseCnt = 0, pwmHighPulse = 0;
    uint16_t modulo = 0;

    switch (currPwmMode)
    {
        case kPWM_SignedCenterAligned:
            modulo   = base->SM[subModule].VAL1 + 1U;
            pulseCnt = modulo * 2U;
            /* Calculate pulse width */
            pwmHighPulse = (pulseCnt * dutyCycle) / 65535U;
            break;
        case kPWM_CenterAligned:
            pulseCnt = base->SM[subModule].VAL1 + 1U;
            /* Calculate pulse width */
            pwmHighPulse = (pulseCnt * dutyCycle) / 65535U;
            break;
        case kPWM_SignedEdgeAligned:
            modulo   = base->SM[subModule].VAL1 + 1U;
            pulseCnt = modulo * 2U;
            /* Calculate pulse width */
            pwmHighPulse = (pulseCnt * dutyCycle) / 65535U;
            break;
        case kPWM_EdgeAligned:
            pulseCnt = base->SM[subModule].VAL1 + 1U;
            /* Calculate pulse width */
            pwmHighPulse = (pulseCnt * dutyCycle) / 65535U;
            break;
        default:
            assert(false);
            break;
    }

    /* Update register about dutycycle */
    if (kPWM_PwmA == pwmSignal)
    {
        PWM_SetDutycycleRegister(base, subModule, kPWM_PwmA, currPwmMode, pulseCnt, pwmHighPulse);
    }
    else if (kPWM_PwmB == pwmSignal)
    {
        PWM_SetDutycycleRegister(base, subModule, kPWM_PwmB, currPwmMode, pulseCnt, pwmHighPulse);
    }
    else
    {
        ; /* Intentional empty */
    }

    if (kPWM_PwmX != pwmSignal)
    {
        /* Get the pwm duty cycle */
        s_pwmGetPwmDutyCycle[subModule][pwmSignal] = (uint8_t)(dutyCycle * 100U / 65535U);
    }
}

/*!
 * brief Update the PWM signal's period and dutycycle for a PWM submodule.
 *
 * The function updates PWM signal period generated by a specific submodule according to the parameters
 * passed in by the user. This function can also set dutycycle weather you want to keep original dutycycle
 * or update new dutycycle. Call this function in local sync control mode because PWM period is depended by
 * INIT and VAL1 register of each submodule. In master sync initialization control mode, call this function
 * to update INIT and VAL1 register of all submodule because PWM period is depended by INIT and VAL1 register
 * in submodule0. If the dead time insertion logic is enabled, the pulse period is reduced by the dead time
 * period specified by the user. PWM signal will not be generated if its period is less than dead time duration.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param pwmSignal   Signal (PWM A or PWM B) to update
 * param currPwmMode The current PWM mode set during PWM setup, options available in enumeration ::pwm_mode_t
 * param pulseCnt    New PWM period, value should be between 0 to 65535
 *                    0=minimum PWM period...
 *                    65535=maximum PWM period
 * param dutyCycle   New PWM pulse width of channel, value should be between 0 to 65535
 *                    0=inactive signal(0% duty cycle)...
 *                    65535=active signal (100% duty cycle)
 *                    You can keep original dutycycle or update new dutycycle
 */
void PWM_UpdatePwmPeriodAndDutycycle(PWM_Type *base,
                                     pwm_submodule_t subModule,
                                     pwm_channels_t pwmSignal,
                                     pwm_mode_t currPwmMode,
                                     uint16_t pulseCnt,
                                     uint16_t dutyCycle)
{
    uint16_t pwmHighPulse = 0;

